class Людина {
    constructor(імʼя, стать) {
      this.імʼя = імʼя;
      this.стать = стать;
    }
  }
  
  class Квартира {
    constructor() {
      this.жителі = [];
    }
  
    додати_жителя(людина) {
      this.жителі.push(людина);
    }

    toString() {
      return `Жителі: ${this.жителі.join(', ')}`;
    }
  }
  
  class Будинок {
    constructor(макс_кількість_квартир) {
      this.квартири = [];
      this.макс_кількість_квартир = макс_кількість_квартир;
    }
  
    додати_квартиру(квартира) {
      if (this.квартири.length < this.макс_кількість_квартир) {
        this.квартири.push(квартира);
      } else {
        console.log("Досягнуто максимальну кількість квартир у будинку.");
      }
    }
  }
  
  // Створення декількох екземплярів класу Людина
  const людина1 = new Людина("Олег", "чоловік");
  const людина2 = new Людина("Оксана", "жінка");

  console.log(людина1)
  console.log(людина2)
  
  // Створення декількох екземплярів класу Квартира
  const квартира1 = new Квартира();
  const квартира2 = new Квартира();
  
  // Додавання екземплярів класу Людина до екземплярів класу Квартира
квартира1.додати_жителя(людина1);
квартира2.додати_жителя(людина2);
  
  console.log(квартира1);
  console.log(квартира2);

  // Створення екземпляру класу Будинок
  const будинок = new Будинок(2);
  
  // Додавання екземплярів класу Квартира до екземпляру класу Будинок
  будинок.додати_квартиру(квартира1);
  будинок.додати_квартиру(квартира2);

  console.log(будинок)